# Многострочность.

# Напишите программу, которая создает и выводит на экран строки, объявленные различными способами:
# Строку с использованием одинарных кавычек.
# Строку с использованием двойных кавычек.
# Многострочную строку с использованием тройных кавычек.

# Напишите тут ваш код
str_1 = 'str_1'
str_2 = "str_2"
str_3 = '''str_3'''

print(str_1, str_2, str_3)