# Экранирование

# Напишите программу, которая создает и выводит на экран строки:
# Строку с вложенными кавычками с использованием разных типов кавычек.
# Строку с вложенными кавычками с использованием экранирования.

# Напишите тут ваш код
str_1 = 'str_1 "str_1"'
str_2 = '\'str_2\''

print(str_1, str_2)