# Произвольная программа

# Напишите программу, которая создает список из произвольных элементов, выводит длину списка, а затем первый и последний элемент списка.

# Напишите тут ваш код
lists = [1, 2, 3, 4, 5, 6, 7]
print(len(lists))
print(lists[0])
print(lists[-1])