# Негатив

# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным.
# Используйте оператор if для проверки.

# Напишите тут ваш код
number = int(input())
if number < 0:
    print(f"Число {number} меньше нуля")
else:
    print(f"Число {number} больше нуля")