# Деление на ноль.

# Напиши программу, которая создает исключение ZeroDivisionError

# Напишите тут ваш код
print(1/0)