# Случайная функция
import random
# Напишите функцию generate_random_number(), которая выводит на экран случайное число от -200 до 0.

# Напишите тут ваш код
def generate_random_number():
    random_number = random.randint(-200, 0)
    print(random_number)

# generate_random_number()