# Суммаист

# Напишите программу, которая запрашивает у пользователя два числа, сохраняет их в переменные и выводит их сумму.
# Пример:
# Введите первое число: 5
# Введите второе число: 7
# Сумма: 12

# Напишите тут ваш код
x = int(input())
y = int(input())

print(x + y)