# Всем привет!

# Напиши программу, которая выводит на экран строку "Привет!" на:
# Китайском
# Японском
# Арабском
# Тайском
# Тамильском

# Напишите тут ваш код
print("你好") # Китайском
print("どうも") # Японском
print(" مرحباً") # Арабском
print("สวัสดี") # Тайском
print("வணக்கம்") # Тамильском