# Семицветик

# Напишите программу, которая создает множество из 7 элементов - названий цветов (color).
# Программа должна вывести все элементы созданного множества на экран.

# Напишите тут ваш код
colors = {'red', 'blue', 'green', 'yellow', 'black', 'white', 'orange'}
for color in colors:
    print(color)