# Запаковка

# Напиши программу, которая содержит словарь, который содержит список, который содержит словарь, который содержит список, который содержит строку.

# Напишите тут ваш код
dictionary = {'1': [
                    # 1,
                    # 2,
                    {
                        '2': [ "3"],
                        # '3': 'temp'
                    }
                   ],
              # '2': 'test'
             }
'''
nested_structure = {
    "level1": [
        {
            "level2": [ "Привет!" ]
        }
    ]
}
'''