# Просто и сложно одновременно

# Создай 5 кортежей с разной длинной: 0 элементов, 1 элемент, 5 элементов, 100 элементов, 1000 элементов.
# Выведи их на экран.

# Напишите тут ваш код
tuple_0 = ()
tuple_1 = (1,)
tuple_5 = (1,) * 5
tuple_100 = (1,) * 100
tuple_1000 = (1, ) * 1000

print(tuple_0)
print(tuple_1)
print(tuple_5)
print(tuple_100)
print((tuple_1000))
