# Распаковка

# Напишите программу, которая создает кортеж из 3 элементов (например, имя, возраст, город).
# Затем программа должна распаковать кортеж в отдельные переменные и вывести каждую переменную.

# Напишите тут ваш код
tuples = ('Bob', 32, 'London')

name, age, city = tuples

print(name)
print(age)
print(city)