# Генератор квадратов

# Напишите программу, которая создает список квадратов чисел от 1 до 10 с использованием List Comprehension.
# Программа должна вывести полученный список.

# Напишите тут ваш код
squares = [i ** 2 for i in range(1, 11)]
print(squares)