# Чтение файла.

# Напишите программу, которая открывает файл example.txt для чтения, читает его содержимое и выводит его на экран.
# После этого закройте файл.

# Напишите тут ваш код
file = open('example.txt', 'r')
content = file.read()
print(content)
file.close()
